---
type: CADLinkOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# CADLinkOptions

`Autodesk.Revit.DB.CADLinkOptions` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CADLinkOptions | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PreserveOverrides | 2018 | `public bool PreserveOverrides { get ; set ; }` |
| Property | ViewId | 2018 | `public ElementId ViewId { get ; set ; }` |